Masmiseim36/Kinetis/targets/Kinetis/CMSIS/MKV56F22.h
/* HSADC - Peripheral instance base addresses */
/** Peripheral HSADC0 base address */
#define HSADC0_BASE                              (0x4005C000u)
/** Peripheral HSADC0 base pointer */
#define HSADC0                                   ((HSADC_Type *)HSADC0_BASE)
#define HSADC0_BASE_PTR                          (HSADC0)
/** Peripheral HSADC1 base address */
#define HSADC1_BASE                              (0x400DC000u)
/** Peripheral HSADC1 base pointer */
#define HSADC1                                   ((HSADC_Type *)HSADC1_BASE)
#define HSADC1_BASE_PTR                          (HSADC1)
/** Array initializer of HSADC peripheral base addresses */
#define HSADC_BASE_ADDRS                         { HSADC0_BASE, HSADC1_BASE }
/** Array initializer of HSADC peripheral base pointers */
#define HSADC_BASE_PTRS                          { HSADC0, HSADC1 }

/* ----------------------------------------------------------------------------
   -- HSADC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup HSADC_Register_Accessor_Macros HSADC - Register accessor macros
 * @{
 */


/* HSADC - Register instance definitions */
/* HSADC0 */
#define HSADC0_CTRL1                             HSADC_CTRL1_REG(HSADC0)
#define HSADC0_CTRL2                             HSADC_CTRL2_REG(HSADC0)
#define HSADC0_ZXCTRL1                           HSADC_ZXCTRL1_REG(HSADC0)
#define HSADC0_ZXCTRL2                           HSADC_ZXCTRL2_REG(HSADC0)
#define HSADC0_CLIST1                            HSADC_CLIST1_REG(HSADC0)
#define HSADC0_CLIST2                            HSADC_CLIST2_REG(HSADC0)
#define HSADC0_CLIST3                            HSADC_CLIST3_REG(HSADC0)
#define HSADC0_CLIST4                            HSADC_CLIST4_REG(HSADC0)
#define HSADC0_SDIS                              HSADC_SDIS_REG(HSADC0)
#define HSADC0_STAT                              HSADC_STAT_REG(HSADC0)
#define HSADC0_RDY                               HSADC_RDY_REG(HSADC0)
#define HSADC0_LOLIMSTAT                         HSADC_LOLIMSTAT_REG(HSADC0)
#define HSADC0_HILIMSTAT                         HSADC_HILIMSTAT_REG(HSADC0)
#define HSADC0_ZXSTAT                            HSADC_ZXSTAT_REG(HSADC0)
#define HSADC0_RSLT0                             HSADC_RSLT_REG(HSADC0,0)
#define HSADC0_RSLT1                             HSADC_RSLT_REG(HSADC0,1)
#define HSADC0_RSLT2                             HSADC_RSLT_REG(HSADC0,2)
#define HSADC0_RSLT3                             HSADC_RSLT_REG(HSADC0,3)
#define HSADC0_RSLT4                             HSADC_RSLT_REG(HSADC0,4)
#define HSADC0_RSLT5                             HSADC_RSLT_REG(HSADC0,5)
#define HSADC0_RSLT6                             HSADC_RSLT_REG(HSADC0,6)
#define HSADC0_RSLT7                             HSADC_RSLT_REG(HSADC0,7)
#define HSADC0_RSLT8                             HSADC_RSLT_REG(HSADC0,8)
#define HSADC0_RSLT9                             HSADC_RSLT_REG(HSADC0,9)
#define HSADC0_RSLT10                            HSADC_RSLT_REG(HSADC0,10)
#define HSADC0_RSLT11                            HSADC_RSLT_REG(HSADC0,11)
#define HSADC0_RSLT12                            HSADC_RSLT_REG(HSADC0,12)
#define HSADC0_RSLT13                            HSADC_RSLT_REG(HSADC0,13)
#define HSADC0_RSLT14                            HSADC_RSLT_REG(HSADC0,14)
#define HSADC0_RSLT15                            HSADC_RSLT_REG(HSADC0,15)
#define HSADC0_LOLIM0                            HSADC_LOLIM_REG(HSADC0,0)
#define HSADC0_LOLIM1                            HSADC_LOLIM_REG(HSADC0,1)
#define HSADC0_LOLIM2                            HSADC_LOLIM_REG(HSADC0,2)
#define HSADC0_LOLIM3                            HSADC_LOLIM_REG(HSADC0,3)
#define HSADC0_LOLIM4                            HSADC_LOLIM_REG(HSADC0,4)
#define HSADC0_LOLIM5                            HSADC_LOLIM_REG(HSADC0,5)
#define HSADC0_LOLIM6                            HSADC_LOLIM_REG(HSADC0,6)
#define HSADC0_LOLIM7                            HSADC_LOLIM_REG(HSADC0,7)
#define HSADC0_LOLIM8                            HSADC_LOLIM_REG(HSADC0,8)
#define HSADC0_LOLIM9                            HSADC_LOLIM_REG(HSADC0,9)
#define HSADC0_LOLIM10                           HSADC_LOLIM_REG(HSADC0,10)
#define HSADC0_LOLIM11                           HSADC_LOLIM_REG(HSADC0,11)
#define HSADC0_LOLIM12                           HSADC_LOLIM_REG(HSADC0,12)
#define HSADC0_LOLIM13                           HSADC_LOLIM_REG(HSADC0,13)
#define HSADC0_LOLIM14                           HSADC_LOLIM_REG(HSADC0,14)
#define HSADC0_LOLIM15                           HSADC_LOLIM_REG(HSADC0,15)
#define HSADC0_HILIM0                            HSADC_HILIM_REG(HSADC0,0)
#define HSADC0_HILIM1                            HSADC_HILIM_REG(HSADC0,1)
#define HSADC0_HILIM2                            HSADC_HILIM_REG(HSADC0,2)
#define HSADC0_HILIM3                            HSADC_HILIM_REG(HSADC0,3)
#define HSADC0_HILIM4                            HSADC_HILIM_REG(HSADC0,4)
#define HSADC0_HILIM5                            HSADC_HILIM_REG(HSADC0,5)
#define HSADC0_HILIM6                            HSADC_HILIM_REG(HSADC0,6)
#define HSADC0_HILIM7                            HSADC_HILIM_REG(HSADC0,7)
#define HSADC0_HILIM8                            HSADC_HILIM_REG(HSADC0,8)
#define HSADC0_HILIM9                            HSADC_HILIM_REG(HSADC0,9)
#define HSADC0_HILIM10                           HSADC_HILIM_REG(HSADC0,10)
#define HSADC0_HILIM11                           HSADC_HILIM_REG(HSADC0,11)
#define HSADC0_HILIM12                           HSADC_HILIM_REG(HSADC0,12)
#define HSADC0_HILIM13                           HSADC_HILIM_REG(HSADC0,13)
#define HSADC0_HILIM14                           HSADC_HILIM_REG(HSADC0,14)
#define HSADC0_HILIM15                           HSADC_HILIM_REG(HSADC0,15)
#define HSADC0_OFFST0                            HSADC_OFFST_REG(HSADC0,0)
#define HSADC0_OFFST1                            HSADC_OFFST_REG(HSADC0,1)
#define HSADC0_OFFST2                            HSADC_OFFST_REG(HSADC0,2)
#define HSADC0_OFFST3                            HSADC_OFFST_REG(HSADC0,3)
#define HSADC0_OFFST4                            HSADC_OFFST_REG(HSADC0,4)
#define HSADC0_OFFST5                            HSADC_OFFST_REG(HSADC0,5)
#define HSADC0_OFFST6                            HSADC_OFFST_REG(HSADC0,6)
#define HSADC0_OFFST7                            HSADC_OFFST_REG(HSADC0,7)
#define HSADC0_OFFST8                            HSADC_OFFST_REG(HSADC0,8)
#define HSADC0_OFFST9                            HSADC_OFFST_REG(HSADC0,9)
#define HSADC0_OFFST10                           HSADC_OFFST_REG(HSADC0,10)
#define HSADC0_OFFST11                           HSADC_OFFST_REG(HSADC0,11)
#define HSADC0_OFFST12                           HSADC_OFFST_REG(HSADC0,12)
#define HSADC0_OFFST13                           HSADC_OFFST_REG(HSADC0,13)
#define HSADC0_OFFST14                           HSADC_OFFST_REG(HSADC0,14)
#define HSADC0_OFFST15                           HSADC_OFFST_REG(HSADC0,15)
#define HSADC0_PWR                               HSADC_PWR_REG(HSADC0)
#define HSADC0_SCTRL                             HSADC_SCTRL_REG(HSADC0)
#define HSADC0_PWR2                              HSADC_PWR2_REG(HSADC0)
#define HSADC0_CTRL3                             HSADC_CTRL3_REG(HSADC0)
#define HSADC0_SCINTEN                           HSADC_SCINTEN_REG(HSADC0)
#define HSADC0_SAMPTIM                           HSADC_SAMPTIM_REG(HSADC0)
#define HSADC0_CALIB                             HSADC_CALIB_REG(HSADC0)
#define HSADC0_CALVAL_A                          HSADC_CALVAL_A_REG(HSADC0)
#define HSADC0_CALVAL_B                          HSADC_CALVAL_B_REG(HSADC0)
#define HSADC0_MUX67_SEL                         HSADC_MUX67_SEL_REG(HSADC0)
/* HSADC1 */
#define HSADC1_CTRL1                             HSADC_CTRL1_REG(HSADC1)
#define HSADC1_CTRL2                             HSADC_CTRL2_REG(HSADC1)
#define HSADC1_ZXCTRL1                           HSADC_ZXCTRL1_REG(HSADC1)
#define HSADC1_ZXCTRL2                           HSADC_ZXCTRL2_REG(HSADC1)
#define HSADC1_CLIST1                            HSADC_CLIST1_REG(HSADC1)
#define HSADC1_CLIST2                            HSADC_CLIST2_REG(HSADC1)
#define HSADC1_CLIST3                            HSADC_CLIST3_REG(HSADC1)
#define HSADC1_CLIST4                            HSADC_CLIST4_REG(HSADC1)
#define HSADC1_SDIS                              HSADC_SDIS_REG(HSADC1)
#define HSADC1_STAT                              HSADC_STAT_REG(HSADC1)
#define HSADC1_RDY                               HSADC_RDY_REG(HSADC1)
#define HSADC1_LOLIMSTAT                         HSADC_LOLIMSTAT_REG(HSADC1)
#define HSADC1_HILIMSTAT                         HSADC_HILIMSTAT_REG(HSADC1)
#define HSADC1_ZXSTAT                            HSADC_ZXSTAT_REG(HSADC1)
#define HSADC1_RSLT0                             HSADC_RSLT_REG(HSADC1,0)
#define HSADC1_RSLT1                             HSADC_RSLT_REG(HSADC1,1)
#define HSADC1_RSLT2                             HSADC_RSLT_REG(HSADC1,2)
#define HSADC1_RSLT3                             HSADC_RSLT_REG(HSADC1,3)
#define HSADC1_RSLT4                             HSADC_RSLT_REG(HSADC1,4)
#define HSADC1_RSLT5                             HSADC_RSLT_REG(HSADC1,5)
#define HSADC1_RSLT6                             HSADC_RSLT_REG(HSADC1,6)
#define HSADC1_RSLT7                             HSADC_RSLT_REG(HSADC1,7)
#define HSADC1_RSLT8                             HSADC_RSLT_REG(HSADC1,8)
#define HSADC1_RSLT9                             HSADC_RSLT_REG(HSADC1,9)
#define HSADC1_RSLT10                            HSADC_RSLT_REG(HSADC1,10)
#define HSADC1_RSLT11                            HSADC_RSLT_REG(HSADC1,11)
#define HSADC1_RSLT12                            HSADC_RSLT_REG(HSADC1,12)
#define HSADC1_RSLT13                            HSADC_RSLT_REG(HSADC1,13)
#define HSADC1_RSLT14                            HSADC_RSLT_REG(HSADC1,14)
#define HSADC1_RSLT15                            HSADC_RSLT_REG(HSADC1,15)
#define HSADC1_LOLIM0                            HSADC_LOLIM_REG(HSADC1,0)
#define HSADC1_LOLIM1                            HSADC_LOLIM_REG(HSADC1,1)
#define HSADC1_LOLIM2                            HSADC_LOLIM_REG(HSADC1,2)
#define HSADC1_LOLIM3                            HSADC_LOLIM_REG(HSADC1,3)
#define HSADC1_LOLIM4                            HSADC_LOLIM_REG(HSADC1,4)
#define HSADC1_LOLIM5                            HSADC_LOLIM_REG(HSADC1,5)
#define HSADC1_LOLIM6                            HSADC_LOLIM_REG(HSADC1,6)
#define HSADC1_LOLIM7                            HSADC_LOLIM_REG(HSADC1,7)
#define HSADC1_LOLIM8                            HSADC_LOLIM_REG(HSADC1,8)
#define HSADC1_LOLIM9                            HSADC_LOLIM_REG(HSADC1,9)
#define HSADC1_LOLIM10                           HSADC_LOLIM_REG(HSADC1,10)
#define HSADC1_LOLIM11                           HSADC_LOLIM_REG(HSADC1,11)
#define HSADC1_LOLIM12                           HSADC_LOLIM_REG(HSADC1,12)
#define HSADC1_LOLIM13                           HSADC_LOLIM_REG(HSADC1,13)
#define HSADC1_LOLIM14                           HSADC_LOLIM_REG(HSADC1,14)
#define HSADC1_LOLIM15                           HSADC_LOLIM_REG(HSADC1,15)
#define HSADC1_HILIM0                            HSADC_HILIM_REG(HSADC1,0)
#define HSADC1_HILIM1                            HSADC_HILIM_REG(HSADC1,1)
#define HSADC1_HILIM2                            HSADC_HILIM_REG(HSADC1,2)
#define HSADC1_HILIM3                            HSADC_HILIM_REG(HSADC1,3)
#define HSADC1_HILIM4                            HSADC_HILIM_REG(HSADC1,4)
#define HSADC1_HILIM5                            HSADC_HILIM_REG(HSADC1,5)
#define HSADC1_HILIM6                            HSADC_HILIM_REG(HSADC1,6)
#define HSADC1_HILIM7                            HSADC_HILIM_REG(HSADC1,7)
#define HSADC1_HILIM8                            HSADC_HILIM_REG(HSADC1,8)
#define HSADC1_HILIM9                            HSADC_HILIM_REG(HSADC1,9)
#define HSADC1_HILIM10                           HSADC_HILIM_REG(HSADC1,10)
#define HSADC1_HILIM11                           HSADC_HILIM_REG(HSADC1,11)
#define HSADC1_HILIM12                           HSADC_HILIM_REG(HSADC1,12)
#define HSADC1_HILIM13                           HSADC_HILIM_REG(HSADC1,13)
#define HSADC1_HILIM14                           HSADC_HILIM_REG(HSADC1,14)
#define HSADC1_HILIM15                           HSADC_HILIM_REG(HSADC1,15)
#define HSADC1_OFFST0                            HSADC_OFFST_REG(HSADC1,0)
#define HSADC1_OFFST1                            HSADC_OFFST_REG(HSADC1,1)
#define HSADC1_OFFST2                            HSADC_OFFST_REG(HSADC1,2)
#define HSADC1_OFFST3                            HSADC_OFFST_REG(HSADC1,3)
#define HSADC1_OFFST4                            HSADC_OFFST_REG(HSADC1,4)
#define HSADC1_OFFST5                            HSADC_OFFST_REG(HSADC1,5)
#define HSADC1_OFFST6                            HSADC_OFFST_REG(HSADC1,6)
#define HSADC1_OFFST7                            HSADC_OFFST_REG(HSADC1,7)
#define HSADC1_OFFST8                            HSADC_OFFST_REG(HSADC1,8)
#define HSADC1_OFFST9                            HSADC_OFFST_REG(HSADC1,9)
#define HSADC1_OFFST10                           HSADC_OFFST_REG(HSADC1,10)
#define HSADC1_OFFST11                           HSADC_OFFST_REG(HSADC1,11)
#define HSADC1_OFFST12                           HSADC_OFFST_REG(HSADC1,12)
#define HSADC1_OFFST13                           HSADC_OFFST_REG(HSADC1,13)
#define HSADC1_OFFST14                           HSADC_OFFST_REG(HSADC1,14)
#define HSADC1_OFFST15                           HSADC_OFFST_REG(HSADC1,15)
#define HSADC1_PWR                               HSADC_PWR_REG(HSADC1)
#define HSADC1_SCTRL                             HSADC_SCTRL_REG(HSADC1)
#define HSADC1_PWR2                              HSADC_PWR2_REG(HSADC1)
#define HSADC1_CTRL3                             HSADC_CTRL3_REG(HSADC1)
#define HSADC1_SCINTEN                           HSADC_SCINTEN_REG(HSADC1)
#define HSADC1_SAMPTIM                           HSADC_SAMPTIM_REG(HSADC1)
#define HSADC1_CALIB                             HSADC_CALIB_REG(HSADC1)
#define HSADC1_CALVAL_A                          HSADC_CALVAL_A_REG(HSADC1)
#define HSADC1_CALVAL_B                          HSADC_CALVAL_B_REG(HSADC1)
#define HSADC1_MUX67_SEL                         HSADC_MUX67_SEL_REG(HSADC1)

/* HSADC - Register array accessors */
#define HSADC0_RSLT(index)                       HSADC_RSLT_REG(HSADC0,index)
#define HSADC1_RSLT(index)                       HSADC_RSLT_REG(HSADC1,index)
#define HSADC0_LOLIM(index)                      HSADC_LOLIM_REG(HSADC0,index)
#define HSADC1_LOLIM(index)                      HSADC_LOLIM_REG(HSADC1,index)
#define HSADC0_HILIM(index)                      HSADC_HILIM_REG(HSADC0,index)
#define HSADC1_HILIM(index)                      HSADC_HILIM_REG(HSADC1,index)
#define HSADC0_OFFST(index)                      HSADC_OFFST_REG(HSADC0,index)
#define HSADC1_OFFST(index)                      HSADC_OFFST_REG(HSADC1,index)

/*!
 * @}
 */ /* end of group HSADC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group HSADC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- I2C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I2C_Peripheral_Access_Layer I2C Peripheral Access Layer
 * @{
 */

/** I2C - Register Layout Typedef */
typedef struct {
  __IO uint8_t A1;                                 /**< I2C Address Register 1, offset: 0x0 */
  __IO uint8_t F;                                  /**< I2C Frequency Divider register, offset: 0x1 */
  __IO uint8_t C1;                                 /**< I2C Control Register 1, offset: 0x2 */
  __IO uint8_t S;                                  /**< I2C Status register, offset: 0x3 */
  __IO uint8_t D;                                  /**< I2C Data I/O register, offset: 0x4 */
  __IO uint8_t C2;                                 /**< I2C Control Register 2, offset: 0x5 */
  __IO uint8_t FLT;                                /**< I2C Programmable Input Glitch Filter Register, offset: 0x6 */
  __IO uint8_t RA;                                 /**< I2C Range Address register, offset: 0x7 */
  __IO uint8_t SMB;                                /**< I2C SMBus Control and Status register, offset: 0x8 */
  __IO uint8_t A2;                                 /**< I2C Address Register 2, offset: 0x9 */
  __IO uint8_t SLTH;                               /**< I2C SCL Low Timeout Register High, offset: 0xA */
  __IO uint8_t SLTL;                               /**< I2C SCL Low Timeout Register Low, offset: 0xB */
} I2C_Type, *I2C_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- I2C - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I2C_Register_Accessor_Macros I2C - Register accessor macros
 * @{
 */


/* I2C - Register accessors */
#define I2C_A1_REG(base)                         ((base)->A1)
#define I2C_F_REG(base)                          ((base)->F)
#define I2C_C1_REG(base)                         ((base)->C1)
#define I2C_S_REG(base)                          ((base)->S)
#define I2C_D_REG(base)                          ((base)->D)
#define I2C_C2_REG(base)                         ((base)->C2)
#define I2C_FLT_REG(base)                        ((base)->FLT)
#define I2C_RA_REG(base)                         ((base)->RA)
#define I2C_SMB_REG(base)                        ((base)->SMB)
#define I2C_A2_REG(base)                         ((base)->A2)
#define I2C_SLTH_REG(base)                       ((base)->SLTH)
#define I2C_SLTL_REG(base)                       ((base)->SLTL)

/*!
 * @}
 */ /* end of group I2C_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- I2C Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I2C_Register_Masks I2C Register Masks
 * @{
 */

