Masmiseim36/Kinetis/targets/Kinetis/CMSIS/MKV56F22.h
/* TYPE Bit Fields */
#define MSCM_TYPE_RYPZ_MASK                      0xFFu
#define MSCM_TYPE_RYPZ_SHIFT                     0
#define MSCM_TYPE_RYPZ_WIDTH                     8
#define MSCM_TYPE_RYPZ(x)                        (((uint32_t)(((uint32_t)(x))<<MSCM_TYPE_RYPZ_SHIFT))&MSCM_TYPE_RYPZ_MASK)
#define MSCM_TYPE_PERSONALITY_MASK               0xFFFFFF00u
#define MSCM_TYPE_PERSONALITY_SHIFT              8
#define MSCM_TYPE_PERSONALITY_WIDTH              24
#define MSCM_TYPE_PERSONALITY(x)                 (((uint32_t)(((uint32_t)(x))<<MSCM_TYPE_PERSONALITY_SHIFT))&MSCM_TYPE_PERSONALITY_MASK)
/* NUM Bit Fields */
#define MSCM_NUM_CPN_MASK                        0x1u
#define MSCM_NUM_CPN_SHIFT                       0
#define MSCM_NUM_CPN_WIDTH                       1
#define MSCM_NUM_CPN(x)                          (((uint32_t)(((uint32_t)(x))<<MSCM_NUM_CPN_SHIFT))&MSCM_NUM_CPN_MASK)
/* MASTER Bit Fields */
#define MSCM_MASTER_PPN_MASK                     0x3Fu
#define MSCM_MASTER_PPN_SHIFT                    0
#define MSCM_MASTER_PPN_WIDTH                    6
#define MSCM_MASTER_PPN(x)                       (((uint32_t)(((uint32_t)(x))<<MSCM_MASTER_PPN_SHIFT))&MSCM_MASTER_PPN_MASK)
/* COUNT Bit Fields */
#define MSCM_COUNT_PCNT_MASK                     0x3u
#define MSCM_COUNT_PCNT_SHIFT                    0
#define MSCM_COUNT_PCNT_WIDTH                    2
#define MSCM_COUNT_PCNT(x)                       (((uint32_t)(((uint32_t)(x))<<MSCM_COUNT_PCNT_SHIFT))&MSCM_COUNT_PCNT_MASK)
/* CFG1 Bit Fields */
#define MSCM_CFG1_L2WY_MASK                      0xFF0000u
#define MSCM_CFG1_L2WY_SHIFT                     16
#define MSCM_CFG1_L2WY_WIDTH                     8
#define MSCM_CFG1_L2WY(x)                        (((uint32_t)(((uint32_t)(x))<<MSCM_CFG1_L2WY_SHIFT))&MSCM_CFG1_L2WY_MASK)
#define MSCM_CFG1_L2SZ_MASK                      0xFF000000u
#define MSCM_CFG1_L2SZ_SHIFT                     24
#define MSCM_CFG1_L2SZ_WIDTH                     8
#define MSCM_CFG1_L2SZ(x)                        (((uint32_t)(((uint32_t)(x))<<MSCM_CFG1_L2SZ_SHIFT))&MSCM_CFG1_L2SZ_MASK)
/* CFG3 Bit Fields */
#define MSCM_CFG3_FPU_MASK                       0x1u
#define MSCM_CFG3_FPU_SHIFT                      0
#define MSCM_CFG3_FPU_WIDTH                      1
#define MSCM_CFG3_FPU(x)                         (((uint32_t)(((uint32_t)(x))<<MSCM_CFG3_FPU_SHIFT))&MSCM_CFG3_FPU_MASK)
#define MSCM_CFG3_SIMD_MASK                      0x2u
#define MSCM_CFG3_SIMD_SHIFT                     1
#define MSCM_CFG3_SIMD_WIDTH                     1
#define MSCM_CFG3_SIMD(x)                        (((uint32_t)(((uint32_t)(x))<<MSCM_CFG3_SIMD_SHIFT))&MSCM_CFG3_SIMD_MASK)
#define MSCM_CFG3_JAZ_MASK                       0x4u
#define MSCM_CFG3_JAZ_SHIFT                      2
#define MSCM_CFG3_JAZ_WIDTH                      1
#define MSCM_CFG3_JAZ(x)                         (((uint32_t)(((uint32_t)(x))<<MSCM_CFG3_JAZ_SHIFT))&MSCM_CFG3_JAZ_MASK)
#define MSCM_CFG3_MMU_MASK                       0x8u
#define MSCM_CFG3_MMU_SHIFT                      3
#define MSCM_CFG3_MMU_WIDTH                      1
#define MSCM_CFG3_MMU(x)                         (((uint32_t)(((uint32_t)(x))<<MSCM_CFG3_MMU_SHIFT))&MSCM_CFG3_MMU_MASK)
#define MSCM_CFG3_TZ_MASK                        0x10u
#define MSCM_CFG3_TZ_SHIFT                       4
#define MSCM_CFG3_TZ_WIDTH                       1
#define MSCM_CFG3_TZ(x)                          (((uint32_t)(((uint32_t)(x))<<MSCM_CFG3_TZ_SHIFT))&MSCM_CFG3_TZ_MASK)
#define MSCM_CFG3_CMP_MASK                       0x20u
#define MSCM_CFG3_CMP_SHIFT                      5
#define MSCM_CFG3_CMP_WIDTH                      1
#define MSCM_CFG3_CMP(x)                         (((uint32_t)(((uint32_t)(x))<<MSCM_CFG3_CMP_SHIFT))&MSCM_CFG3_CMP_MASK)
#define MSCM_CFG3_BB_MASK                        0x40u
#define MSCM_CFG3_BB_SHIFT                       6
#define MSCM_CFG3_BB_WIDTH                       1
#define MSCM_CFG3_BB(x)                          (((uint32_t)(((uint32_t)(x))<<MSCM_CFG3_BB_SHIFT))&MSCM_CFG3_BB_MASK)
#define MSCM_CFG3_SBP_MASK                       0x300u
#define MSCM_CFG3_SBP_SHIFT                      8
#define MSCM_CFG3_SBP_WIDTH                      2
#define MSCM_CFG3_SBP(x)                         (((uint32_t)(((uint32_t)(x))<<MSCM_CFG3_SBP_SHIFT))&MSCM_CFG3_SBP_MASK)
/* OCMDR Bit Fields */
#define MSCM_OCMDR_OCMPU_MASK                    0x1000u
#define MSCM_OCMDR_OCMPU_SHIFT                   12
#define MSCM_OCMDR_OCMPU_WIDTH                   1
#define MSCM_OCMDR_OCMPU(x)                      (((uint32_t)(((uint32_t)(x))<<MSCM_OCMDR_OCMPU_SHIFT))&MSCM_OCMDR_OCMPU_MASK)
#define MSCM_OCMDR_OCMT_MASK                     0xE000u
#define MSCM_OCMDR_OCMT_SHIFT                    13
#define MSCM_OCMDR_OCMT_WIDTH                    3
#define MSCM_OCMDR_OCMT(x)                       (((uint32_t)(((uint32_t)(x))<<MSCM_OCMDR_OCMT_SHIFT))&MSCM_OCMDR_OCMT_MASK)
#define MSCM_OCMDR_OCMW_MASK                     0xE0000u
#define MSCM_OCMDR_OCMW_SHIFT                    17
#define MSCM_OCMDR_OCMW_WIDTH                    3
#define MSCM_OCMDR_OCMW(x)                       (((uint32_t)(((uint32_t)(x))<<MSCM_OCMDR_OCMW_SHIFT))&MSCM_OCMDR_OCMW_MASK)
#define MSCM_OCMDR_OCMSZ_MASK                    0xF000000u
#define MSCM_OCMDR_OCMSZ_SHIFT                   24
#define MSCM_OCMDR_OCMSZ_WIDTH                   4
#define MSCM_OCMDR_OCMSZ(x)                      (((uint32_t)(((uint32_t)(x))<<MSCM_OCMDR_OCMSZ_SHIFT))&MSCM_OCMDR_OCMSZ_MASK)
#define MSCM_OCMDR_OCMSZH_MASK                   0x10000000u
#define MSCM_OCMDR_OCMSZH_SHIFT                  28
#define MSCM_OCMDR_OCMSZH_WIDTH                  1
#define MSCM_OCMDR_OCMSZH(x)                     (((uint32_t)(((uint32_t)(x))<<MSCM_OCMDR_OCMSZH_SHIFT))&MSCM_OCMDR_OCMSZH_MASK)
#define MSCM_OCMDR_FMT_MASK                      0x40000000u
#define MSCM_OCMDR_FMT_SHIFT                     30
#define MSCM_OCMDR_FMT_WIDTH                     1
#define MSCM_OCMDR_FMT(x)                        (((uint32_t)(((uint32_t)(x))<<MSCM_OCMDR_FMT_SHIFT))&MSCM_OCMDR_FMT_MASK)
#define MSCM_OCMDR_V_MASK                        0x80000000u
#define MSCM_OCMDR_V_SHIFT                       31
#define MSCM_OCMDR_V_WIDTH                       1
#define MSCM_OCMDR_V(x)                          (((uint32_t)(((uint32_t)(x))<<MSCM_OCMDR_V_SHIFT))&MSCM_OCMDR_V_MASK)

/*!
 * @}
 */ /* end of group MSCM_Register_Masks */


/* MSCM - Peripheral instance base addresses */
/** Peripheral MSCM base address */
#define MSCM_BASE                                (0x40001000u)
/** Peripheral MSCM base pointer */
#define MSCM                                     ((MSCM_Type *)MSCM_BASE)
#define MSCM_BASE_PTR                            (MSCM)
/** Array initializer of MSCM peripheral base addresses */
#define MSCM_BASE_ADDRS                          { MSCM_BASE }
/** Array initializer of MSCM peripheral base pointers */
#define MSCM_BASE_PTRS                           { MSCM }

/* ----------------------------------------------------------------------------
   -- MSCM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCM_Register_Accessor_Macros MSCM - Register accessor macros
 * @{
 */


