Masmiseim36/Kinetis/targets/Kinetis/CMSIS/MKV56F22.h
#define PWM1_SM2DTCNT0                           PWM_DTCNT0_REG(PWM1,2)
#define PWM1_SM2DTCNT1                           PWM_DTCNT1_REG(PWM1,2)
#define PWM1_SM2CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM1,2)
#define PWM1_SM2CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM1,2)
#define PWM1_SM2CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM1,2)
#define PWM1_SM2CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM1,2)
#define PWM1_SM2CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM1,2)
#define PWM1_SM2CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM1,2)
#define PWM1_SM2CVAL0                            PWM_CVAL0_REG(PWM1,2)
#define PWM1_SM2CVAL0CYC                         PWM_CVAL0CYC_REG(PWM1,2)
#define PWM1_SM2CVAL1                            PWM_CVAL1_REG(PWM1,2)
#define PWM1_SM2CVAL1CYC                         PWM_CVAL1CYC_REG(PWM1,2)
#define PWM1_SM2CVAL2                            PWM_CVAL2_REG(PWM1,2)
#define PWM1_SM2CVAL2CYC                         PWM_CVAL2CYC_REG(PWM1,2)
#define PWM1_SM2CVAL3                            PWM_CVAL3_REG(PWM1,2)
#define PWM1_SM2CVAL3CYC                         PWM_CVAL3CYC_REG(PWM1,2)
#define PWM1_SM2CVAL4                            PWM_CVAL4_REG(PWM1,2)
#define PWM1_SM2CVAL4CYC                         PWM_CVAL4CYC_REG(PWM1,2)
#define PWM1_SM2CVAL5                            PWM_CVAL5_REG(PWM1,2)
#define PWM1_SM2CVAL5CYC                         PWM_CVAL5CYC_REG(PWM1,2)
#define PWM1_SM3CNT                              PWM_CNT_REG(PWM1,3)
#define PWM1_SM3INIT                             PWM_INIT_REG(PWM1,3)
#define PWM1_SM3CTRL2                            PWM_CTRL2_REG(PWM1,3)
#define PWM1_SM3CTRL                             PWM_CTRL_REG(PWM1,3)
#define PWM1_SM3VAL0                             PWM_VAL0_REG(PWM1,3)
#define PWM1_SM3FRACVAL1                         PWM_FRACVAL1_REG(PWM1,3)
#define PWM1_SM3VAL1                             PWM_VAL1_REG(PWM1,3)
#define PWM1_SM3FRACVAL2                         PWM_FRACVAL2_REG(PWM1,3)
#define PWM1_SM3VAL2                             PWM_VAL2_REG(PWM1,3)
#define PWM1_SM3FRACVAL3                         PWM_FRACVAL3_REG(PWM1,3)
#define PWM1_SM3VAL3                             PWM_VAL3_REG(PWM1,3)
#define PWM1_SM3FRACVAL4                         PWM_FRACVAL4_REG(PWM1,3)
#define PWM1_SM3VAL4                             PWM_VAL4_REG(PWM1,3)
#define PWM1_SM3FRACVAL5                         PWM_FRACVAL5_REG(PWM1,3)
#define PWM1_SM3VAL5                             PWM_VAL5_REG(PWM1,3)
#define PWM1_SM3FRCTRL                           PWM_FRCTRL_REG(PWM1,3)
#define PWM1_SM3OCTRL                            PWM_OCTRL_REG(PWM1,3)
#define PWM1_SM3STS                              PWM_STS_REG(PWM1,3)
#define PWM1_SM3INTEN                            PWM_INTEN_REG(PWM1,3)
#define PWM1_SM3DMAEN                            PWM_DMAEN_REG(PWM1,3)
#define PWM1_SM3TCTRL                            PWM_TCTRL_REG(PWM1,3)
#define PWM1_SM3DISMAP0                          PWM_DISMAP_REG(PWM1,3,0)
#define PWM1_SM3DTCNT0                           PWM_DTCNT0_REG(PWM1,3)
#define PWM1_SM3DTCNT1                           PWM_DTCNT1_REG(PWM1,3)
#define PWM1_SM3CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM1,3)
#define PWM1_SM3CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM1,3)
#define PWM1_SM3CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM1,3)
#define PWM1_SM3CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM1,3)
#define PWM1_SM3CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM1,3)
#define PWM1_SM3CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM1,3)
#define PWM1_SM3CVAL0                            PWM_CVAL0_REG(PWM1,3)
#define PWM1_SM3CVAL0CYC                         PWM_CVAL0CYC_REG(PWM1,3)
#define PWM1_SM3CVAL1                            PWM_CVAL1_REG(PWM1,3)
#define PWM1_SM3CVAL1CYC                         PWM_CVAL1CYC_REG(PWM1,3)
#define PWM1_SM3CVAL2                            PWM_CVAL2_REG(PWM1,3)
#define PWM1_SM3CVAL2CYC                         PWM_CVAL2CYC_REG(PWM1,3)
#define PWM1_SM3CVAL3                            PWM_CVAL3_REG(PWM1,3)
#define PWM1_SM3CVAL3CYC                         PWM_CVAL3CYC_REG(PWM1,3)
#define PWM1_SM3CVAL4                            PWM_CVAL4_REG(PWM1,3)
#define PWM1_SM3CVAL4CYC                         PWM_CVAL4CYC_REG(PWM1,3)
#define PWM1_SM3CVAL5                            PWM_CVAL5_REG(PWM1,3)
#define PWM1_SM3CVAL5CYC                         PWM_CVAL5CYC_REG(PWM1,3)
#define PWM1_OUTEN                               PWM_OUTEN_REG(PWM1)
#define PWM1_MASK                                PWM_MASK_REG(PWM1)
#define PWM1_SWCOUT                              PWM_SWCOUT_REG(PWM1)
#define PWM1_DTSRCSEL                            PWM_DTSRCSEL_REG(PWM1)
#define PWM1_MCTRL0                              PWM_MCTRL_REG(PWM1)
#define PWM1_MCTRL1                              PWM_MCTRL2_REG(PWM1)
#define PWM1_FCTRL0                              PWM_FCTRL_REG(PWM1)
#define PWM1_FSTS0                               PWM_FSTS_REG(PWM1)
#define PWM1_FFILT0                              PWM_FFILT_REG(PWM1)
#define PWM1_FTST0                               PWM_FTST_REG(PWM1)
#define PWM1_FCTRL20                             PWM_FCTRL2_REG(PWM1)

/* PWM - Register array accessors */
#define PWM0_CNT(index)                          PWM_CNT_REG(PWM0,index)
#define PWM1_CNT(index)                          PWM_CNT_REG(PWM1,index)
#define PWM0_INIT(index)                         PWM_INIT_REG(PWM0,index)
#define PWM1_INIT(index)                         PWM_INIT_REG(PWM1,index)
#define PWM0_CTRL2(index)                        PWM_CTRL2_REG(PWM0,index)
#define PWM1_CTRL2(index)                        PWM_CTRL2_REG(PWM1,index)
#define PWM0_CTRL(index)                         PWM_CTRL_REG(PWM0,index)
#define PWM1_CTRL(index)                         PWM_CTRL_REG(PWM1,index)
#define PWM0_VAL0(index)                         PWM_VAL0_REG(PWM0,index)
#define PWM1_VAL0(index)                         PWM_VAL0_REG(PWM1,index)
#define PWM0_FRACVAL1(index)                     PWM_FRACVAL1_REG(PWM0,index)
#define PWM1_FRACVAL1(index)                     PWM_FRACVAL1_REG(PWM1,index)
#define PWM0_VAL1(index)                         PWM_VAL1_REG(PWM0,index)
#define PWM1_VAL1(index)                         PWM_VAL1_REG(PWM1,index)
#define PWM0_FRACVAL2(index)                     PWM_FRACVAL2_REG(PWM0,index)
#define PWM1_FRACVAL2(index)                     PWM_FRACVAL2_REG(PWM1,index)
#define PWM0_VAL2(index)                         PWM_VAL2_REG(PWM0,index)
#define PWM1_VAL2(index)                         PWM_VAL2_REG(PWM1,index)
#define PWM0_FRACVAL3(index)                     PWM_FRACVAL3_REG(PWM0,index)
#define PWM1_FRACVAL3(index)                     PWM_FRACVAL3_REG(PWM1,index)
#define PWM0_VAL3(index)                         PWM_VAL3_REG(PWM0,index)
#define PWM1_VAL3(index)                         PWM_VAL3_REG(PWM1,index)
#define PWM0_FRACVAL4(index)                     PWM_FRACVAL4_REG(PWM0,index)
#define PWM1_FRACVAL4(index)                     PWM_FRACVAL4_REG(PWM1,index)
#define PWM0_VAL4(index)                         PWM_VAL4_REG(PWM0,index)
#define PWM1_VAL4(index)                         PWM_VAL4_REG(PWM1,index)
#define PWM0_FRACVAL5(index)                     PWM_FRACVAL5_REG(PWM0,index)
#define PWM1_FRACVAL5(index)                     PWM_FRACVAL5_REG(PWM1,index)
#define PWM0_VAL5(index)                         PWM_VAL5_REG(PWM0,index)
#define PWM1_VAL5(index)                         PWM_VAL5_REG(PWM1,index)
#define PWM0_FRCTRL(index)                       PWM_FRCTRL_REG(PWM0,index)
#define PWM1_FRCTRL(index)                       PWM_FRCTRL_REG(PWM1,index)
#define PWM0_OCTRL(index)                        PWM_OCTRL_REG(PWM0,index)
#define PWM1_OCTRL(index)                        PWM_OCTRL_REG(PWM1,index)
#define PWM0_STS(index)                          PWM_STS_REG(PWM0,index)
#define PWM1_STS(index)                          PWM_STS_REG(PWM1,index)
#define PWM0_INTEN(index)                        PWM_INTEN_REG(PWM0,index)
#define PWM1_INTEN(index)                        PWM_INTEN_REG(PWM1,index)
#define PWM0_DMAEN(index)                        PWM_DMAEN_REG(PWM0,index)
#define PWM1_DMAEN(index)                        PWM_DMAEN_REG(PWM1,index)
#define PWM0_TCTRL(index)                        PWM_TCTRL_REG(PWM0,index)
#define PWM1_TCTRL(index)                        PWM_TCTRL_REG(PWM1,index)
#define PWM0_DISMAP(index,index2)                PWM_DISMAP_REG(PWM0,index,index2)
#define PWM1_DISMAP(index,index2)                PWM_DISMAP_REG(PWM1,index,index2)
#define PWM0_DTCNT0(index)                       PWM_DTCNT0_REG(PWM0,index)
#define PWM1_DTCNT0(index)                       PWM_DTCNT0_REG(PWM1,index)
#define PWM0_DTCNT1(index)                       PWM_DTCNT1_REG(PWM0,index)
#define PWM1_DTCNT1(index)                       PWM_DTCNT1_REG(PWM1,index)
#define PWM0_CAPTCTRLA(index)                    PWM_CAPTCTRLA_REG(PWM0,index)
#define PWM1_CAPTCTRLA(index)                    PWM_CAPTCTRLA_REG(PWM1,index)
#define PWM0_CAPTCOMPA(index)                    PWM_CAPTCOMPA_REG(PWM0,index)
#define PWM1_CAPTCOMPA(index)                    PWM_CAPTCOMPA_REG(PWM1,index)
#define PWM0_CAPTCTRLB(index)                    PWM_CAPTCTRLB_REG(PWM0,index)
#define PWM1_CAPTCTRLB(index)                    PWM_CAPTCTRLB_REG(PWM1,index)
#define PWM0_CAPTCOMPB(index)                    PWM_CAPTCOMPB_REG(PWM0,index)
#define PWM1_CAPTCOMPB(index)                    PWM_CAPTCOMPB_REG(PWM1,index)
#define PWM0_CAPTCTRLX(index)                    PWM_CAPTCTRLX_REG(PWM0,index)
#define PWM1_CAPTCTRLX(index)                    PWM_CAPTCTRLX_REG(PWM1,index)
#define PWM0_CAPTCOMPX(index)                    PWM_CAPTCOMPX_REG(PWM0,index)
#define PWM1_CAPTCOMPX(index)                    PWM_CAPTCOMPX_REG(PWM1,index)
#define PWM0_CVAL0(index)                        PWM_CVAL0_REG(PWM0,index)
#define PWM1_CVAL0(index)                        PWM_CVAL0_REG(PWM1,index)
#define PWM0_CVAL0CYC(index)                     PWM_CVAL0CYC_REG(PWM0,index)
#define PWM1_CVAL0CYC(index)                     PWM_CVAL0CYC_REG(PWM1,index)
#define PWM0_CVAL1(index)                        PWM_CVAL1_REG(PWM0,index)
#define PWM1_CVAL1(index)                        PWM_CVAL1_REG(PWM1,index)
#define PWM0_CVAL1CYC(index)                     PWM_CVAL1CYC_REG(PWM0,index)
#define PWM1_CVAL1CYC(index)                     PWM_CVAL1CYC_REG(PWM1,index)
#define PWM0_CVAL2(index)                        PWM_CVAL2_REG(PWM0,index)
#define PWM1_CVAL2(index)                        PWM_CVAL2_REG(PWM1,index)
#define PWM0_CVAL2CYC(index)                     PWM_CVAL2CYC_REG(PWM0,index)
#define PWM1_CVAL2CYC(index)                     PWM_CVAL2CYC_REG(PWM1,index)
#define PWM0_CVAL3(index)                        PWM_CVAL3_REG(PWM0,index)
#define PWM1_CVAL3(index)                        PWM_CVAL3_REG(PWM1,index)
#define PWM0_CVAL3CYC(index)                     PWM_CVAL3CYC_REG(PWM0,index)
#define PWM1_CVAL3CYC(index)                     PWM_CVAL3CYC_REG(PWM1,index)
#define PWM0_CVAL4(index)                        PWM_CVAL4_REG(PWM0,index)
#define PWM1_CVAL4(index)                        PWM_CVAL4_REG(PWM1,index)
#define PWM0_CVAL4CYC(index)                     PWM_CVAL4CYC_REG(PWM0,index)
#define PWM1_CVAL4CYC(index)                     PWM_CVAL4CYC_REG(PWM1,index)
#define PWM0_CVAL5(index)                        PWM_CVAL5_REG(PWM0,index)
#define PWM1_CVAL5(index)                        PWM_CVAL5_REG(PWM1,index)
#define PWM0_CVAL5CYC(index)                     PWM_CVAL5CYC_REG(PWM0,index)
#define PWM1_CVAL5CYC(index)                     PWM_CVAL5CYC_REG(PWM1,index)

/*!
 * @}
 */ /* end of group PWM_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group PWM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Peripheral_Access_Layer RCM Peripheral Access Layer
 * @{
 */

/** RCM - Register Layout Typedef */
typedef struct {
  __I  uint8_t SRS0;                               /**< System Reset Status Register 0, offset: 0x0 */
  __I  uint8_t SRS1;                               /**< System Reset Status Register 1, offset: 0x1 */
       uint8_t RESERVED_0[2];
  __IO uint8_t RPFC;                               /**< Reset Pin Filter Control register, offset: 0x4 */
  __IO uint8_t RPFW;                               /**< Reset Pin Filter Width register, offset: 0x5 */
       uint8_t RESERVED_1[2];
  __IO uint8_t SSRS0;                              /**< Sticky System Reset Status Register 0, offset: 0x8 */
  __IO uint8_t SSRS1;                              /**< Sticky System Reset Status Register 1, offset: 0x9 */
} RCM_Type, *RCM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- RCM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Register_Accessor_Macros RCM - Register accessor macros
 * @{
 */


/* RCM - Register accessors */
#define RCM_SRS0_REG(base)                       ((base)->SRS0)
#define RCM_SRS1_REG(base)                       ((base)->SRS1)
#define RCM_RPFC_REG(base)                       ((base)->RPFC)
#define RCM_RPFW_REG(base)                       ((base)->RPFW)
#define RCM_SSRS0_REG(base)                      ((base)->SSRS0)
#define RCM_SSRS1_REG(base)                      ((base)->SSRS1)

/*!
 * @}
 */ /* end of group RCM_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- RCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Register_Masks RCM Register Masks
 * @{
 */

/* SRS0 Bit Fields */
#define RCM_SRS0_WAKEUP_MASK                     0x1u
#define RCM_SRS0_WAKEUP_SHIFT                    0
#define RCM_SRS0_WAKEUP_WIDTH                    1
#define RCM_SRS0_WAKEUP(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_WAKEUP_SHIFT))&RCM_SRS0_WAKEUP_MASK)
#define RCM_SRS0_LVD_MASK                        0x2u
#define RCM_SRS0_LVD_SHIFT                       1
#define RCM_SRS0_LVD_WIDTH                       1
#define RCM_SRS0_LVD(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_LVD_SHIFT))&RCM_SRS0_LVD_MASK)
#define RCM_SRS0_LOC_MASK                        0x4u
#define RCM_SRS0_LOC_SHIFT                       2
#define RCM_SRS0_LOC_WIDTH                       1
#define RCM_SRS0_LOC(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_LOC_SHIFT))&RCM_SRS0_LOC_MASK)
#define RCM_SRS0_LOL_MASK                        0x8u
#define RCM_SRS0_LOL_SHIFT                       3
#define RCM_SRS0_LOL_WIDTH                       1
#define RCM_SRS0_LOL(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_LOL_SHIFT))&RCM_SRS0_LOL_MASK)
#define RCM_SRS0_WDOG_MASK                       0x20u
#define RCM_SRS0_WDOG_SHIFT                      5
#define RCM_SRS0_WDOG_WIDTH                      1
#define RCM_SRS0_WDOG(x)                         (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_WDOG_SHIFT))&RCM_SRS0_WDOG_MASK)
#define RCM_SRS0_PIN_MASK                        0x40u
#define RCM_SRS0_PIN_SHIFT                       6
#define RCM_SRS0_PIN_WIDTH                       1
#define RCM_SRS0_PIN(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_PIN_SHIFT))&RCM_SRS0_PIN_MASK)
#define RCM_SRS0_POR_MASK                        0x80u
#define RCM_SRS0_POR_SHIFT                       7
#define RCM_SRS0_POR_WIDTH                       1
#define RCM_SRS0_POR(x)                          (((uint8_t)(((uint8_t)(x))<<RCM_SRS0_POR_SHIFT))&RCM_SRS0_POR_MASK)
/* SRS1 Bit Fields */
#define RCM_SRS1_JTAG_MASK                       0x1u
#define RCM_SRS1_JTAG_SHIFT                      0
#define RCM_SRS1_JTAG_WIDTH                      1
#define RCM_SRS1_JTAG(x)                         (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_JTAG_SHIFT))&RCM_SRS1_JTAG_MASK)
#define RCM_SRS1_LOCKUP_MASK                     0x2u
#define RCM_SRS1_LOCKUP_SHIFT                    1
#define RCM_SRS1_LOCKUP_WIDTH                    1
#define RCM_SRS1_LOCKUP(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_LOCKUP_SHIFT))&RCM_SRS1_LOCKUP_MASK)
#define RCM_SRS1_SW_MASK                         0x4u
#define RCM_SRS1_SW_SHIFT                        2
#define RCM_SRS1_SW_WIDTH                        1
#define RCM_SRS1_SW(x)                           (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_SW_SHIFT))&RCM_SRS1_SW_MASK)
#define RCM_SRS1_MDM_AP_MASK                     0x8u
#define RCM_SRS1_MDM_AP_SHIFT                    3
#define RCM_SRS1_MDM_AP_WIDTH                    1
#define RCM_SRS1_MDM_AP(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_MDM_AP_SHIFT))&RCM_SRS1_MDM_AP_MASK)
#define RCM_SRS1_SACKERR_MASK                    0x20u
#define RCM_SRS1_SACKERR_SHIFT                   5
#define RCM_SRS1_SACKERR_WIDTH                   1
#define RCM_SRS1_SACKERR(x)                      (((uint8_t)(((uint8_t)(x))<<RCM_SRS1_SACKERR_SHIFT))&RCM_SRS1_SACKERR_MASK)
/* RPFC Bit Fields */
#define RCM_RPFC_RSTFLTSRW_MASK                  0x3u
#define RCM_RPFC_RSTFLTSRW_SHIFT                 0
#define RCM_RPFC_RSTFLTSRW_WIDTH                 2
#define RCM_RPFC_RSTFLTSRW(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSRW_SHIFT))&RCM_RPFC_RSTFLTSRW_MASK)
#define RCM_RPFC_RSTFLTSS_MASK                   0x4u
#define RCM_RPFC_RSTFLTSS_SHIFT                  2
#define RCM_RPFC_RSTFLTSS_WIDTH                  1
#define RCM_RPFC_RSTFLTSS(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSS_SHIFT))&RCM_RPFC_RSTFLTSS_MASK)
/* RPFW Bit Fields */
#define RCM_RPFW_RSTFLTSEL_MASK                  0x1Fu
#define RCM_RPFW_RSTFLTSEL_SHIFT                 0
#define RCM_RPFW_RSTFLTSEL_WIDTH                 5
#define RCM_RPFW_RSTFLTSEL(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_RPFW_RSTFLTSEL_SHIFT))&RCM_RPFW_RSTFLTSEL_MASK)
/* SSRS0 Bit Fields */
#define RCM_SSRS0_SWAKEUP_MASK                   0x1u
#define RCM_SSRS0_SWAKEUP_SHIFT                  0
#define RCM_SSRS0_SWAKEUP_WIDTH                  1
#define RCM_SSRS0_SWAKEUP(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SWAKEUP_SHIFT))&RCM_SSRS0_SWAKEUP_MASK)
#define RCM_SSRS0_SLVD_MASK                      0x2u
#define RCM_SSRS0_SLVD_SHIFT                     1
#define RCM_SSRS0_SLVD_WIDTH                     1
#define RCM_SSRS0_SLVD(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SLVD_SHIFT))&RCM_SSRS0_SLVD_MASK)
#define RCM_SSRS0_SLOC_MASK                      0x4u
#define RCM_SSRS0_SLOC_SHIFT                     2
#define RCM_SSRS0_SLOC_WIDTH                     1
#define RCM_SSRS0_SLOC(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SLOC_SHIFT))&RCM_SSRS0_SLOC_MASK)
#define RCM_SSRS0_SLOL_MASK                      0x8u
#define RCM_SSRS0_SLOL_SHIFT                     3
#define RCM_SSRS0_SLOL_WIDTH                     1
#define RCM_SSRS0_SLOL(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SLOL_SHIFT))&RCM_SSRS0_SLOL_MASK)
#define RCM_SSRS0_SWDOG_MASK                     0x20u
#define RCM_SSRS0_SWDOG_SHIFT                    5
#define RCM_SSRS0_SWDOG_WIDTH                    1
#define RCM_SSRS0_SWDOG(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SWDOG_SHIFT))&RCM_SSRS0_SWDOG_MASK)
#define RCM_SSRS0_SPIN_MASK                      0x40u
#define RCM_SSRS0_SPIN_SHIFT                     6
#define RCM_SSRS0_SPIN_WIDTH                     1
#define RCM_SSRS0_SPIN(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SPIN_SHIFT))&RCM_SSRS0_SPIN_MASK)
#define RCM_SSRS0_SPOR_MASK                      0x80u
#define RCM_SSRS0_SPOR_SHIFT                     7
#define RCM_SSRS0_SPOR_WIDTH                     1
#define RCM_SSRS0_SPOR(x)                        (((uint8_t)(((uint8_t)(x))<<RCM_SSRS0_SPOR_SHIFT))&RCM_SSRS0_SPOR_MASK)
/* SSRS1 Bit Fields */
#define RCM_SSRS1_SJTAG_MASK                     0x1u
#define RCM_SSRS1_SJTAG_SHIFT                    0
#define RCM_SSRS1_SJTAG_WIDTH                    1
#define RCM_SSRS1_SJTAG(x)                       (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SJTAG_SHIFT))&RCM_SSRS1_SJTAG_MASK)
#define RCM_SSRS1_SLOCKUP_MASK                   0x2u
#define RCM_SSRS1_SLOCKUP_SHIFT                  1
#define RCM_SSRS1_SLOCKUP_WIDTH                  1
#define RCM_SSRS1_SLOCKUP(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SLOCKUP_SHIFT))&RCM_SSRS1_SLOCKUP_MASK)
#define RCM_SSRS1_SSW_MASK                       0x4u
#define RCM_SSRS1_SSW_SHIFT                      2
#define RCM_SSRS1_SSW_WIDTH                      1
#define RCM_SSRS1_SSW(x)                         (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SSW_SHIFT))&RCM_SSRS1_SSW_MASK)
#define RCM_SSRS1_SMDM_AP_MASK                   0x8u
#define RCM_SSRS1_SMDM_AP_SHIFT                  3
#define RCM_SSRS1_SMDM_AP_WIDTH                  1
#define RCM_SSRS1_SMDM_AP(x)                     (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SMDM_AP_SHIFT))&RCM_SSRS1_SMDM_AP_MASK)
#define RCM_SSRS1_SSACKERR_MASK                  0x20u
#define RCM_SSRS1_SSACKERR_SHIFT                 5
#define RCM_SSRS1_SSACKERR_WIDTH                 1
#define RCM_SSRS1_SSACKERR(x)                    (((uint8_t)(((uint8_t)(x))<<RCM_SSRS1_SSACKERR_SHIFT))&RCM_SSRS1_SSACKERR_MASK)

/*!
 * @}
 */ /* end of group RCM_Register_Masks */


